{
  "HomeFeature.Beautify": "Beautify",
  "HomeFeature.Tree": "Tree",
  "HomeFeature.Text": "Text",
  "HomeFeature.EmptyText": "No JSON was inserted. Write something and try again.",
  "HomeFeature.InvalidJSON": "The text you entered is not valid JSON. Please enter a valid JSON to print.",
  "HomeSubFeature.Ops": "Ooops!",
  "HomeSubFeature.Ok": "OK",
  "HomeUi.Validate": "Validate",
  "HomeUi.File": "File",
  "HomeUi.URL": "URL",
  "HomeUi.Download": "Download",
  "HomeUi.ValidJ": "Valid JSON",
  "HomeUi.Copy": "Copy",
  "HomeUi.Copied": "Copied",
  "HomeUi.Print": "Print",
  "HomeUi.Delete": "Clear",
  "HomeUi.Expand": "Expand section",
  "HomeUi.Contract": "Contract section",
  "FooterUi.Created": "Copyright © Francesco Nicolò Giacomazzo. All rights reserved.",
  "PrivacyUi.SiteName": "Privacy Policy for Beautify JSON",
  "PrivacyUi.GeneralPrivacy": "Welcome to Beautify JSON. This page outlines our policy on the collection, use, and disclosure of personal information in connection with the use of Google AdSense on our site.",
  "PrivacyUi.InfoAdsTitle": "Information Collected by Google AdSense",
  "PrivacyUi.InfoAds": "Our site uses Google AdSense, an advertising service provided by Google Inc. Google AdSense uses cookies to display ads relevant to users based on their visit to our site and other sites on the Internet. These cookies collect non-personal information about the user, such as device type, browser type, IP address, and pages visited.",
  "PrivacyUi.UseAdsTitle": "Use of Data by Google AdSense",
  "PrivacyUi.UseAdsPre": "Information collected by Google AdSense is subject to their privacy policy, which you can find ",
  "PrivacyUi.UseAdsAft": ". Google uses this information to analyze user interactions with ads and to provide targeted ads to users of our site.",
  "PrivacyUi.DisableAdsTitle": "Disabling Cookies",
  "PrivacyUi.DisableAds": "Users can choose to disable Google AdSense cookies by visiting the Google Ad settings page. Alternatively, users can disable third-party cookies using their browser settings.",
  "PrivacyUi.ThirdPartTitle": "Other Third Parties",
  "PrivacyUi.ThirdPart": "In addition to Google AdSense, we may use other advertising networks or third-party analytics services. Information collected by these third parties is subject to their respective privacy policies.",
  "PrivacyUi.ModifyPolicyTitle": "Changes to this Privacy Policy",
  "PrivacyUi.ModifyPolicy": "We reserve the right to update or modify this Privacy Policy at any time. Users will be informed of any changes by posting the new Privacy Policy on this page.",
  "PrivacyUi.AcceptTitle": "Acceptance of These Terms",
  "PrivacyUi.Accept": "By using our site, you automatically accept the terms of this Privacy Policy.",
  "PrivacyUi.ContactTitle": "Contact Us",
  "PrivacyUi.Contact": "If you have any questions or concerns regarding this Privacy Policy, you can contact us at",
  "PrivacyUi.Git": "Github page.",
  "PrivacyUi.Thanks": "Thank you for your trust and understanding."
}