{
  "HomeFeature.Beautify": "Beautify",
  "HomeFeature.Code": "Code",
  "HomeFeature.Tree": "Tree",
  "HomeFeature.Text": "Text",
  "HomeFeature.EmptyText": "No JSON was inserted. Write something and try again.",
  "HomeFeature.InvalidJSON": "The text you entered is not valid JSON. Please enter a valid JSON to print.",
  "HomeSubFeature.Ops": "Ooops!",
  "HomeSubFeature.Ok": "OK",
  "HomeUi.Validate": "Validate",
  "HomeUi.File": "File",
  "HomeUi.URL": "URL",
  "HomeUi.Download": "Download",
  "HomeUi.ValidJ": "Valid JSON",
  "HomeUi.Copy": "Copy",
  "HomeUi.Copied": "Copied",
  "HomeUi.Format": "Format JSON",
  "HomeUi.Print": "Print",
  "HomeUi.Delete": "Clear",
  "HomeUi.Expand": "Expand section",
  "HomeUi.Contract": "Contract section",
  "HomeUi.Name": "Beautify JSON",
  "HomeUi.InfoSite": "If you have ever worked with JSON data, you know how frustrating it can be to analyze an untidy document. With Beautify JSON, we make this experience more enjoyable and efficient. Our tool allows you to format and organize your JSON data clearly and legibly with just one click. Whether you're a developer, an analyst, or a data enthusiast, simplifying the visualization and understanding of your JSON has never been easier. Try our free service now and discover how to enhance your working experience with JSON!",
  "HomeUi.WhatIsTitle": "What Is JSON",
  "HomeUi.WhatIs": "JSON, an acronym for \"JavaScript Object Notation,\" is a lightweight data interchange format. Created to facilitate data transmission between a server and a web client, JSON has become a common standard for the structured representation of information. Its simplicity and human-readable nature make it widely used in web application development and system communication. Data in JSON format is organized into key-value pairs and nested structures, providing an effective way to represent complex information in an easily understandable format. JSON is language-independent, meaning it can be used with a wide range of programming languages.",
  "HomeUi.WhyUseTitle": "Why use JSON?",
  "HomeUi.WhyUse": "In addition to its flexibility and ease of comprehension, the JSON format offers numerous practical advantages that make it a preferred choice in software development and data communication. Here are some key reasons to use the JSON format:<ul><li><strong>Interoperability</strong>: JSON is language-independent, meaning it can be easily used in heterogeneous environments. This feature allows different systems to communicate with each other without being bound to a specific language, facilitating interoperability across various technologies and platforms.</li><li><strong>Readability and Simplified Writing</strong>: The key-value structure of JSON and its readable syntax make writing and reading data straightforward. This clarity makes debugging easier and allows developers to quickly understand the data structure even in advanced stages of development.</li><li><strong>Efficiency in Data Transmission</strong>: JSON is a lightweight format, requiring less storage space and proving more efficient during data transmission across the network. This is particularly important in web applications, where page loading speed and responsiveness are crucial for an optimal user experience.</li><li><strong>Wide Support</strong>: The popularity of JSON has led to broad support from numerous programming languages. Libraries for JSON data manipulation are available for virtually all major languages, simplifying the integration and processing of data within applications.</li><li><strong>Complex Data Structures</strong>: JSON allows the representation of complex data through the use of nested structures, arrays, and objects. This flexibility enables developers to model complex data in intuitive ways, ensuring an accurate and structured representation of information.</li></ul><br>In summary, the combination of interoperability, readability, efficiency, and broad support makes the JSON format an excellent choice for data exchange in different contexts, contributing to the success of modern web applications and distributed systems.",
  "HomeUi.WhatCanDoTitle": "What can you do with Beautify JSON?",
  "HomeUi.WhatCanDo": "<ul><li>Beautify / Format your JSON</li><li>Display your JSON as tree</li><li>Validate your JSON and help you to fix an error</li><li>Load your JSON from a file</li><li>Load your JSON from an url</li><li>Download your formatted JSON</li><li>Print your formatted JSON</li></ul>",
  "HomeUi.RuleTitle": "JSON Syntax",
  "HomeUi.Rule": "The syntax of JSON (JavaScript Object Notation) is simple and clear, designed for ease of reading and writing by developers. Below are the key elements of JSON syntax:<ul><li>An JSON object is enclosed in curly braces {} and consists of key-value pairs. Keys must be strings, and values can be strings, numbers, booleans, null, objects, or arrays.</li><li>A JSON array is enclosed in square brackets [] and contains an ordered list of values. Array elements can be strings, numbers, booleans, null, objects, or other arrays.</li><li>Strings are sequences of characters enclosed in double quotes \"\".</li><li>Numbers can be integers or decimals and are written without quotes.</li><li>JSON supports boolean values true and false, in addition to the special value null.</li></ul>",
  "HomeUi.Common": "JSON example",
  "HomeUi.ErrorTitle": "Common Errors",
  "HomeUi.Error": "<ul><li>Strings must be enclosed in double quotes. Without them, a syntax error occurs.</li><li>Object keys must be strings and enclosed in double quotes.</li><li>Only double quotes are valid for JSON strings, not single quotes.</li><li>Adding an extra comma to the last element of an object or array results in a syntax error.</li><li>Null, true, and false are special values and must be written in lowercase.</li><li>JSON does not support comments. Adding comments results in a syntax error.</li></ul>",
  "HomeUi.DifferentResultTitle": "Different Results",
  "HomeUi.DifferentResult": "If you're using a Windows computer, you might get different results. This is likely because of how Windows handles newline characters. Essentially, if your JSON contains only newline characters <code>(\\n)</code> and you paste it into JSONLint from a Windows computer, it might mistakenly validate it as correct. This happens because Windows may require a carriage return <code>(\\r)</code> as well to properly detect newlines. As a solution, you can either use direct URL input or ensure that the newline characters in your content match the architecture your system expects!",
  "HomeUi.Search": "Search",
  "FooterUi.Created": "Copyright © Francesco Nicolò Giacomazzo. All rights reserved.",
  "PrivacyUi.SiteName": "Privacy Policy for Beautify JSON",
  "PrivacyUi.GeneralPrivacy": "Welcome to Beautify JSON. This page outlines our policy on the collection, use, and disclosure of personal information in connection with the use of Google AdSense on our site.",
  "PrivacyUi.InfoAdsTitle": "Information Collected by Google AdSense",
  "PrivacyUi.InfoAds": "Our site uses Google AdSense, an advertising service provided by Google Inc. Google AdSense uses cookies to display ads relevant to users based on their visit to our site and other sites on the Internet. These cookies collect non-personal information about the user, such as device type, browser type, IP address, and pages visited.",
  "PrivacyUi.UseAdsTitle": "Use of Data by Google AdSense",
  "PrivacyUi.UseAdsPre": "Information collected by Google AdSense is subject to their privacy policy, which you can find ",
  "PrivacyUi.UseAdsAft": ". Google uses this information to analyze user interactions with ads and to provide targeted ads to users of our site.",
  "PrivacyUi.DisableAdsTitle": "Disabling Cookies",
  "PrivacyUi.DisableAds": "Users can choose to disable Google AdSense cookies by visiting the Google Ad settings page. Alternatively, users can disable third-party cookies using their browser settings.",
  "PrivacyUi.ThirdPartTitle": "Other Third Parties",
  "PrivacyUi.ThirdPart": "In addition to Google AdSense, we may use other advertising networks or third-party analytics services. Information collected by these third parties is subject to their respective privacy policies.",
  "PrivacyUi.ModifyPolicyTitle": "Changes to this Privacy Policy",
  "PrivacyUi.ModifyPolicy": "We reserve the right to update or modify this Privacy Policy at any time. Users will be informed of any changes by posting the new Privacy Policy on this page.",
  "PrivacyUi.AcceptTitle": "Acceptance of These Terms",
  "PrivacyUi.Accept": "By using our site, you automatically accept the terms of this Privacy Policy.",
  "PrivacyUi.ContactTitle": "Contact Us",
  "PrivacyUi.Contact": "If you have any questions or concerns regarding this Privacy Policy, you can contact us at",
  "PrivacyUi.Git": "Github page.",
  "PrivacyUi.Thanks": "Thank you for your trust and understanding."
}