{
  "HomeFeature.Beautify": "Abbellisci",
  "HomeFeature.Tree": "Oggetto",
  "HomeFeature.Text": "Testo",
  "HomeFeature.EmptyText": "Non è stato inserito nessun JSON. Scrivi qualcosa e riprova.",
  "HomeFeature.InvalidJSON": "Il testo che hai inserito non è un JSON valido. Insierisci un JSON valido per poter stampare.",
  "HomeSubFeature.Ops": "Ooops!",
  "HomeSubFeature.Ok": "OK",
  "HomeUi.Validate": "Valida",
  "HomeUi.File": "File",
  "HomeUi.URL": "URL",
  "HomeUi.Download": "Download",
  "HomeUi.ValidJ": "JSON Valido",
  "HomeUi.Copy": "Copia",
  "HomeUi.Copied": "Copiato",
  "HomeUi.Print": "Stampa",
  "HomeUi.Delete": "Cancella",
  "HomeUi.Expand": "Espandi sezione",
  "HomeUi.Contract": "Comprimi sezione",
  "HomeUi.Name": "Beautify JSON",
  "HomeUi.InfoSite": "Se hai mai lavorato con dati JSON, sai quanto possa essere frustrante analizzare un documento poco ordinato. Con Beautify JSON, rendiamo questa esperienza più piacevole e efficiente. Il nostro strumento ti permette di formattare e organizzare i tuoi dati JSON in modo chiaro e leggibile con un solo clic. Sia che tu sia uno sviluppatore, un analista o un appassionato di dati, semplificare la visualizzazione e la comprensione del tuo JSON non è mai stato così facile. Prova subito il nostro servizio gratuito e scopri come migliorare la tua esperienza di lavoro con JSON!",
  "HomeUi.WhatIsTitle": "Cos'è JSON",
  "HomeUi.WhatIs": "JSON, acronimo di \"JavaScript Object Notation\", è un formato leggero di scambio di dati. Creato per facilitare la trasmissione dei dati tra un server e un client web, JSON è diventato uno standard comune per la rappresentazione strutturata di informazioni. La sua semplicità e la sua leggibilità da parte umana lo rendono ampiamente utilizzato nello sviluppo di applicazioni web e nella comunicazione tra sistemi. I dati in formato JSON sono organizzati in coppie chiave-valore e strutture annidate, offrendo un modo efficace per rappresentare informazioni complesse in un formato facilmente comprensibile. JSON è indipendente dal linguaggio di programmazione, il che significa che può essere utilizzato con una vasta gamma di linguaggi di programmazione.",
  "HomeUi.WhatCanDoTitle": "Che cosa puoi fare con Beautify JSON?",
  "HomeUi.WhatCanDo": "<ul><li>Migliorare / Formattare il tuo JSON</li><li>Vede il tuo JSON come un'albero</li><li>Validare il tuo JSON e aiutarti a sistemare gli errori</li><li>Caricare il tuo JSON da un file</li><li>Caricare il tuo JSON da un url</li><li>Scaricare il tuo JSON formattato</li><li>Stampare il tuo JSON formattato</li></ul>",
  "HomeUi.RuleTitle": "Sintassi JSON",
  "HomeUi.Rule": "La sintassi di JSON (JavaScript Object Notation) è semplice e chiara, progettata per la facilità di lettura e scrittura da parte degli sviluppatori. Qui di seguito sono riportati gli elementi chiave della sintassi JSON:<ul><li>Un oggetto JSON è racchiuso tra parentesi graffe {} e consiste in coppie chiave-valore. Le chiavi devono essere stringhe, e i valori possono essere stringhe, numeri, booleani, null, oggetti o array.</li><li>Un array JSON è racchiuso tra parentesi quadre [] e contiene una lista ordinata di valori. Gli elementi dell'array possono essere stringhe, numeri, booleani, null, oggetti o altri array.</li><li>Le stringhe sono sequenze di caratteri racchiuse tra virgolette doppie \"\".</li><li>I numeri possono essere interi o decimali e sono scritti senza virgolette.</li><li>JSON supporta i valori booleani true e false, oltre al valore speciale null.</li></ul>",
  "HomeUi.Common": "Esempio JSON",
  "HomeUi.ErrorTitle": "Errori Comuni",
  "HomeUi.Error": "<ul><li>Le stringhe devono essere racchiuse tra virgolette doppie. Senza di esse, si verifica un errore di sintassi.</li><li>Le chiavi di un oggetto devono essere stringhe e racchiuse tra virgolette doppie.</li><li>Solo le virgolette doppie sono valide per le stringhe JSON, non le virgolette singole.</li><li>L'aggiunta di una virgola aggiuntiva all'ultimo elemento di un oggetto o di un array genera un errore di sintassi.</li></li>Null, true e false sono valori speciali e devono essere scritti in minuscolo.</li><li> JSON non supporta commenti. L'aggiunta di commenti genera un errore di sintassi.</li></ul>",
  "HomeUi.Search": "Cerca",
  "FooterUi.Created": "Copyright © Francesco Nicolò Giacomazzo. Tutti i diritti riservati.",
  "PrivacyUi.SiteName": "Privacy Policy per Beautify JSON",
  "PrivacyUi.GeneralPrivacy": "Benvenuto su Beautify JSON. Questa pagina illustra la nostra politica sulla raccolta, l'uso e la divulgazione delle informazioni personali in relazione all'utilizzo di Google AdSense sul nostro sito.",
  "PrivacyUi.InfoAdsTitle": "Informazioni Raccolte da Google AdSense",
  "PrivacyUi.InfoAds": "Il nostro sito utilizza Google AdSense, un servizio di pubblicità fornito da Google Inc. Google AdSense utilizza cookie per pubblicare annunci pertinenti agli utenti in base alla loro visita al nostro sito e ad altri siti su Internet. Questi cookie raccolgono informazioni non personali sull'utente, come il tipo di dispositivo, il tipo di browser, l'indirizzo IP e le pagine visitate.",
  "PrivacyUi.UseAdsTitle": "Uso dei Dati da Parte di Google AdSense",
  "PrivacyUi.UseAdsPre": "Le informazioni raccolte da Google AdSense sono soggette alla loro politica sulla privacy, che puoi trovare ",
  "PrivacyUi.UseAdsAft": ". Google utilizza queste informazioni per analizzare le tue interazioni con gli annunci pubblicitari e per fornire annunci mirati agli utenti del nostro sito.",
  "PrivacyUi.DisableAdsTitle": "Disattivazione dei Cookie",
  "PrivacyUi.DisableAds": "Gli utenti possono scegliere di disabilitare i cookie di Google AdSense visitando la pagina delle impostazioni degli annunci di Google. In alternativa, gli utenti possono disabilitare i cookie di terze parti utilizzando le impostazioni del proprio browser.",
  "PrivacyUi.ThirdPartTitle": "Altre Terze Parti",
  "PrivacyUi.ThirdPart": "Oltre a Google AdSense, potremmo utilizzare altre reti pubblicitarie o servizi di analisi di terze parti. Le informazioni raccolte da queste terze parti sono soggette alle rispettive politiche sulla privacy.",
  "PrivacyUi.ModifyPolicyTitle": "Modifiche a questa Privacy Policy",
  "PrivacyUi.ModifyPolicy": "Ci riserviamo il diritto di aggiornare o modificare la presente Privacy Policy in qualsiasi momento. Gli utenti saranno informati di eventuali cambiamenti pubblicando la nuova Privacy Policy su questa pagina.",
  "PrivacyUi.AcceptTitle": "Accettazione di Questi Termini",
  "PrivacyUi.Accept": "Utilizzando il nostro sito, si accettano automaticamente i termini di questa Privacy Policy.",
  "PrivacyUi.ContactTitle": "Contattaci",
  "PrivacyUi.Contact": "Se hai domande o preoccupazioni riguardo a questa Privacy Policy, puoi contattarci alla nostra",
  "PrivacyUi.Git": "pagina GitHub.",
  "PrivacyUi.Thanks": "Grazie per la fiducia e la comprensione."
}